	/***！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
	原因是优先级设置HAL_NVIC_SetPriority(EXTI2_IRQn, 0, 0);		 //此时就不可以了
	               HAL_NVIC_SetPriority(EXTI2_IRQn, 1, 0);//和串口一样，可以使用
	！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！*/
	
	/*****问题是缺这行代码，使得卡在printf跑不动
  HAL_UART_Init(&huart1);
	******/
	


/**
  ******************************************************************************
  * @file    main.c 
  * @author  hezhijie157(cpe.fjnu.edu.cn)
  * @brief   Main program body
  ******************************************************************************
  * Change Logs:
  * Date           Author       Notes
  * 
  ******************************************************************************
  */
/* Macro ---------------------------------------------------------------------*/
#define MAIN_CONFIG

/* Includes ------------------------------------------------------------------*/
#include "config.h"

int main(void)
{
    sys_init();

	while (1)
	{
		task_run();
    
	}
}


/**********************************END OF FILE**********************************/
