		/***
	原因是函数传递参数尤其是第二个参数缺少&，
	参数传递错误，
	缺函数头文件在.c或者.h中的声明
	****/
	
	
	/*****原因是问题是缺这行代码，使得卡在printf跑不动
  HAL_UART_Init(&huart1);
	******/
	


/**
  ******************************************************************************
  * @file    main.c 
  * @author  hezhijie157(cpe.fjnu.edu.cn)
  * @brief   Main program body
  ******************************************************************************
  * Change Logs:
  * Date           Author       Notes
  * 
  ******************************************************************************
  */
/* Macro ---------------------------------------------------------------------*/
#define MAIN_CONFIG

/* Includes ------------------------------------------------------------------*/
#include "config.h"

int main(void)
{
    sys_init();

	while (1)
	{
		task_run();
    
	}
}


/**********************************END OF FILE**********************************/
